In [1]:
import numpy as np
import pandas  as pd
from pandas import Series,DataFrame

In [3]:
ser1=Series([0,1,2],index=['A','B','C'])
ser1

A    0
B    1
C    2
dtype: int64

In [4]:
ser2=Series([3,4,5,6],index=['A','B','C','D'])
ser2

A    3
B    4
C    5
D    6
dtype: int64

In [5]:
ser1+ser2

A    3.0
B    5.0
C    7.0
D    NaN
dtype: float64

In [6]:
df1=DataFrame(np.arange(4).reshape((2,2)),columns=list('AB'),index=['JD','JP'])
df1

    A  B
JD  0  1
JP  2  3

In [7]:
df2=DataFrame(np.arange(9).reshape((3,3)),columns=list('ADC'),index=['JD','JP','DL'])
df2

    A  D  C
JD  0  1  2
JP  3  4  5
DL  6  7  8

In [8]:
df1+df2

      A   B   C   D
DL  NaN NaN NaN NaN
JD  0.0 NaN NaN NaN
JP  5.0 NaN NaN NaN

In [9]:
df1.add(df2,fill_value=0)

      A    B    C    D
DL  6.0  NaN  8.0  7.0
JD  0.0  1.0  2.0  1.0
JP  5.0  3.0  5.0  4.0

In [10]:
ser3=df2.iloc[0]
ser3

A    0
D    1
C    2
Name: JD, dtype: int32

In [11]:
df2-ser3

    A  D  C
JD  0  0  0
JP  3  3  3
DL  6  6  6

In [12]:
df2.A

JD    0
JP    3
DL    6
Name: A, dtype: int32

In [13]:
df2

    A  D  C
JD  0  1  2
JP  3  4  5
DL  6  7  8